# CannotUnderstandAtLine Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..KeyBasedTreeFileFailures..::..CannotUnderstandAtLine Property
BuiltInFailures..::..KeyBasedTreeFileFailures Class See Also
---
Cannot understand [EntryType] line '[Number]'
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotUnderstandAtLine { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotUnderstandAtLine As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotUnderstandAtLine {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..KeyBasedTreeFileFailures Class
Autodesk.Revit.DB Namespace